CSI API ETABS v1
cSpandrelLabel.GetSpandrel Method
 Retrieves the specified Spandrel Label
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpandrel(
	string Name,
	ref bool IsMultiStory
)
Function GetSpandrel (
	Name As String,
	ByRef IsMultiStory As Boolean
) As Integer
Dim instance As cSpandrelLabel
Dim Name As String
Dim IsMultiStory As Boolean
Dim returnValue As Integer
returnValue = instance.GetSpandrel(Name,
	IsMultiStory)
int GetSpandrel(
	String^ Name,
	bool% IsMultiStory
)
abstract GetSpandrel :
        Name : string *
        IsMultiStory : bool byref -> int
Parameters
Name
Type: System.String
 The name of an existing Spandrel Label
IsMultiStory
Type: System.Boolean
 Whether the Spandrel Label spans multiple story levels
Return Value
Type: Int32
 Returns zero if the Spandrel Label exists, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim IsMultiStory As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Spandrel label
    ret = SapModel.SpandrelLabel.SetSpandrel("MySpandrel", False)
'check Spandrel label
    ret = SapModel.SpandrelLabel.GetSpandrel("MySpandrel", IsMultiStory)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cSpandrelLabel Interface
ETABSv1 Namespace